#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-zXjU1yon4Rqv7E5L

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state...
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=315687832]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=1089363423]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116162803320500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116162803367200000004]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116162803345100000002]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116162803358800000003]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_launch_template.worker_x86 will be created
  + resource "aws_launch_template" "worker_x86" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0c82f7789103a1e20"
      + instance_type          = "t3.medium"
      + key_name               = "mhayden"
      + latest_version         = (known after apply)
      + name                   = "imagebuilder-worker-x86"
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder worker"
          + "ServiceOwner" = "Image Builder"
        }
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybQpIT1NUTkFNRT13b3JrZXItZmxlZXQtdGVzdGluZwoKIyBTZXQgdGhlIGhvc3RuYW1lIHRvIHRoZSBob3N0bmFtZSBwYXNzZWQgYnkgdGVycmFmb3JtLgpob3N0bmFtZWN0bCBzZXQtaG9zdG5hbWUgJFNZU1RFTV9IT1NUTkFNRQoKZG5mIC15IHVwZ3JhZGUKCg=="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + iops        = (known after apply)
              + volume_size = 50
              + volume_type = "gp2"
            }
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "AppCode"      = "IMGB-001"
              + "Name"         = "Image Builder worker"
              + "ServiceOwner" = "Image Builder"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "AppCode"      = "IMGB-001"
              + "Name"         = "Image Builder worker"
              + "ServiceOwner" = "Image Builder"
            }
        }
    }

  # aws_security_group.allow_icmp will be created
  + resource "aws_security_group" "allow_icmp" {
      + arn                    = (known after apply)
      + description            = "Allow SSH access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ICMP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "allow-ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "allow-icmp"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "ssh"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow-ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "allow-ssh"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_spot_fleet_request.imagebuilder_worker_x86 will be created
  + resource "aws_spot_fleet_request" "imagebuilder_worker_x86" {
      + allocation_strategy                 = "lowestPrice"
      + client_token                        = (known after apply)
      + excess_capacity_termination_policy  = "Default"
      + fleet_type                          = "maintain"
      + iam_fleet_role                      = "arn:aws:iam::933752197999:role/aws-service-role/spotfleet.amazonaws.com/AWSServiceRoleForEC2SpotFleet"
      + id                                  = (known after apply)
      + instance_interruption_behaviour     = "terminate"
      + instance_pools_to_use_count         = 1
      + load_balancers                      = (known after apply)
      + replace_unhealthy_instances         = false
      + spot_request_state                  = (known after apply)
      + tags                                = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder worker fleet"
          + "ServiceOwner" = "Image Builder"
        }
      + target_capacity                     = 1
      + target_group_arns                   = (known after apply)
      + terminate_instances_with_expiration = true
      + wait_for_fulfillment                = false

      + launch_template_config {
          + launch_template_specification {
              + id      = (known after apply)
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*